IdeaRS.OpenModel.CrossSection.CrossSectionGeneralColdFormed
Creates one item cross-section of general cold formed profile defined by it´s center line

IdeaRS.OpenModel.CrossSection.CrossSectionGeneralColdFormed.#ctor
Constructor

IdeaRS.OpenModel.CrossSection.CrossSectionGeneralColdFormed.Centerline
Centerline of cross-section made from linear segments

IdeaRS.OpenModel.CrossSection.CrossSectionGeneralColdFormed.CrossSectionType
Type of cross-section

IdeaRS.OpenModel.CrossSection.CrossSectionGeneralColdFormed.Material
Material of cross-section

IdeaRS.OpenModel.CrossSection.CrossSectionGeneralColdFormed.Thickness
Thickness of thin wall cross-section

IdeaRS.OpenModel.CrossSection.CrossSectionGeneralColdFormed.Radius
Inner rounding radius between linear segments of centerline